# SD-MSCF-DET: multimodal P2 detector with MSCF-C3 and SD-PSA
# 核心架构: 基于 yolo11n-mm-mid-p2 的四尺度检测 (P2,P3,P4,P5)
# 核心增强: MSCF-C3、SD-PSA 与 SOEP-RFPN 协同优化特征提取和特征金字塔
# 设计原则: 在四尺度检测框架下，通过SPDConv、CSPOmniKernel、SNI、GSConvE等模块增强特征提取与融合，提升小目标检测性能。

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# 骨干保持与标准 mid-p2 版本一致，P4/P5 做双模态融合；P2 在 head 中引入
backbone:
  # ========== RGB路径 (层0-10) ==========
  - [-1, 1, Conv, [64, 3, 2], 'RGB']      # 0-P1/2 RGB起始
  - [-1, 1, Conv, [128, 3, 2]]            # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2  (RGB_P2)
  - [-1, 1, Conv, [256, 3, 2]]            # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4  (RGB_P3)
  - [-1, 1, Conv, [512, 3, 2]]            # 5-P4/16
  - [-1, 2, MSCF_C3, [512, True]]      # 6  (RGB_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 7-P5/32
  - [-1, 2, MSCF_C3, [1024, True]]     # 8
  - [-1, 1, SPPF, [1024, 5]]              # 9
  - [-1, 2, SD_PSA, [1024]]           # 10 (RGB_P5)

  # ========== X路径 (层11-21) ==========
  - [-1, 1, Conv, [64, 3, 2], 'X']        # 11-P1/2 X起始
  - [-1, 1, Conv, [128, 3, 2]]            # 12-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 13 (X_P2)
  - [-1, 1, Conv, [256, 3, 2]]            # 14-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]     # 15 (X_P3)
  - [-1, 1, Conv, [512, 3, 2]]            # 16-P4/16
  - [-1, 2, MSCF_C3, [512, True]]      # 17 (X_P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 18-P5/32
  - [-1, 2, MSCF_C3, [1024, True]]     # 19
  - [-1, 1, SPPF, [1024, 5]]              # 20
  - [-1, 2, SD_PSA, [1024]]           # 21 (X_P5)

  # ========== P4 与 P5 融合 ==========
  - [[6, 17], 1, Concat, [1]]             # 22: 融合 P4 -> (Fused_P4_in)
  - [-1, 2, MSCF_C3, [1024, True]]     # 23: Fused_P4
  - [[10, 21], 1, Concat, [1]]            # 24: 融合 P5 -> (Fused_P5_in)
  - [-1, 2, MSCF_C3, [1024, True]]     # 25
  - [-1, 1, SD_PSA, [1024]]           # 26: Fused_P5

# Head: SOEP-RFPN增强的颈部，进行四尺度检测
head:
  # 自顶向下路径 (FPN with SNI)
  - [26, 1, SNI, [2]]                     # 27: Fused_P5 软插值上采样
  - [[-1, 23], 1, Concat, [1]]            # 28: + Fused_P4
  - [-1, 2, C3k2, [512, False]]           # 29: P4上下文特征 (P4_ctx)

  # === SOEP小目标增强应用于P3分支  ===
  - [-1, 1, SNI, [2]]                     # 30: 软插值上采样到P3尺度
  - [2, 1, SPDConv, [256]]                # 31: RGB_P2(2)经过SPDConv处理
  - [[-1, -2, 4], 1, Concat, [1]]         # 32: 三路融合: SPDConv(31) + 上采样特征(30) + RGB_P3(4)
  - [-1, 1, CSPOmniKernel, []]            # 33: 多尺度核融合+频域增强
  - [-1, 2, C3k2, [256, False]]           # 34: 增强的P3/8特征 (P3_enhanced)

  # 从增强的P3生成P2检测分支 (使用SNI)
  - [-1, 1, SNI, [2]]                     # 35: P3_enhanced -> P2尺度 软插值上采样
  - [[-1, 2], 1, Concat, [1]]             # 36: 与原始的 RGB_P2(2) 融合
  - [-1, 2, C3k2, [128, False]]           # 37: P2/4检测特征 (P2_out)

  # 自底向上路径 (PAN with GSConvE)
  - [37, 1, GSConvE, [128, 3, 2]]         # 38: P2_out -> P3 增强型下采样
  - [[-1, 34], 1, Concat, [1]]            # 39: + P3_enhanced(34)
  - [-1, 2, C3k2, [256, False]]           # 40: 精炼 P3 (P3_refined)

  - [-1, 1, GSConvE, [256, 3, 2]]         # 41: P3_refined -> P4 增强型下采样
  - [[-1, 29], 1, Concat, [1]]            # 42: + P4_ctx(29)
  - [-1, 2, C3k2, [512, False]]           # 43: 精炼 P4 (P4_refined)

  - [-1, 1, GSConvE, [512, 3, 2]]         # 44: P4_refined -> P5 增强型下采样
  - [[-1, 26], 1, Concat, [1]]            # 45: + Fused_P5(26)
  - [-1, 2, MSCF_C3, [1024, True]]     # 46: 精炼 P5 (P5_refined)

  # 四尺度检测输出
  - [[37, 40, 43, 46], 1, Detect, [nc]]   # 47 Detect(P2_out, P3_refined, P4_refined, P5_refined)
