nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2], 'RGB']
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, MSCF_C3, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, MSCF_C3, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, SD_PSA, [1024]]
  - [-1, 1, Conv, [64, 3, 2], 'X']
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, MSCF_C3, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, MSCF_C3, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, SD_PSA, [1024]]
  - [[6, 17], 1, Concat, [1]]
  - [-1, 2, MSCF_C3, [1024, True]]
  - [[10, 21], 1, Concat, [1]]
  - [-1, 2, MSCF_C3, [1024, True]]
  - [-1, 1, SD_PSA, [1024]]

head:
  - [26, 1, SNI, [2]]
  - [[-1, 23], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]
  - [-1, 1, SNI, [2]]
  - [2, 1, GSConvE, [256, 3, 2]]
  - [[-1, -2, 4], 1, Concat, [1]]
  - [-1, 1, Conv, [256, 3, 1]]
  - [-1, 2, C3k2, [256, False]]
  - [-1, 1, SNI, [2]]
  - [[-1, 2], 1, Concat, [1]]
  - [-1, 2, C3k2, [128, False]]
  - [37, 1, GSConvE, [128, 3, 2]]
  - [[-1, 34], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]]
  - [-1, 1, GSConvE, [256, 3, 2]]
  - [[-1, 29], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]]
  - [-1, 1, GSConvE, [512, 3, 2]]
  - [[-1, 26], 1, Concat, [1]]
  - [-1, 2, MSCF_C3, [1024, True]]
  - [[37, 40, 43, 46], 1, Detect, [nc]]
